In [1]:
import pandas as pd
import os

In [2]:
df = pd.read_excel('./MASTERLIST 32K.xlsx')
df.head()

,NO.,ORG,LAST,FIRST,MIDDLE,FULLNAME,YEAR,MONTH,DAY,POSITION,...,CIVIL STATUS,BIRTH PLACE,PROVINCIAL ADDRESS,TOTAL FAMILY MEMBERS,EDUCATIONAL BACKGROUND,WORK,PRECINCT #,NOTE,REMARKS,Unnamed: 22
0,NaN,BATANG LACSON,LORESTO,XIEMON LARS,MORALES,"LORESTO, XIEMON LARS MORALES",1999,11,3,MEMBER,...,NaN,NaN,NaN,NaN,NaN,NaN,0554A,NaN,NaN,NaN
1,NaN,KKM,ABAD,JOVITA,FLORES,"ABAD, JOVITA FLORES",1956,5,17,MEMBER,...,NaN,NaN,NaN,NaN,NaN,NaN,0556A,OK,NaN,NaN
2,NaN,KKM,ABADEJOS,DOROTHY,ECHALAS,"ABADEJOS, DOROTHY ECHALAS",1974,1,8,MEMBER,...,NaN,NaN,NaN,NaN,NaN,NaN,0570B,OK,NaN,NaN
3,NaN,KKM,ABELLA,LIEZEL,GUILING,"ABELLA, LIEZEL GUILING",1984,6,18,MEMBER,...,NaN,NaN,NaN,NaN,NaN,NaN,0570B,NO ID,NaN,NaN
4,NaN,KKM,ABORDO,ANAPHIE,ESTRABELA,"ABORDO, ANAPHIE ESTRABELA",1980,1,7,MEMBER,...,NaN,NaN,NaN,NaN,NaN,NaN,0559A,NO ID,NaN,NaN

In [3]:
df.shape

(32089, 23)

In [4]:
df['ORG'].value_counts()

ORG
LAKAS                                 9914
KKM                                   9799
THUNDERS                              8813
SANGLAHI                              1450
REPUBLIKA                             1211
BATANG LACSON                          898
SPECIAL OPS                              2
                                         1
KKM                                      1
Name: count, dtype: int64

In [5]:
df['ORG'].unique()

array(['BATANG LACSON', 'KKM', 'LAKAS', 'REPUBLIKA', 'SANGLAHI',
       'THUNDERS', '                                  ', 'SPECIAL OPS',
       'KKM '], dtype=object)

In [6]:
df['ORG'] = df['ORG'].replace({'KKM ': 'KKM'})

In [7]:
df['ORG'].value_counts()

ORG
LAKAS                                 9914
KKM                                   9800
THUNDERS                              8813
SANGLAHI                              1450
REPUBLIKA                             1211
BATANG LACSON                          898
SPECIAL OPS                              2
                                         1
Name: count, dtype: int64

In [8]:
df.columns

Index(['NO.', 'ORG', 'LAST', 'FIRST', 'MIDDLE', 'FULLNAME', 'YEAR', 'MONTH',
       'DAY', 'POSITION', 'ADDRESS', 'BARANGAY', 'SEX', 'CIVIL STATUS',
       'BIRTH PLACE', 'PROVINCIAL ADDRESS', 'TOTAL FAMILY MEMBERS',
       'EDUCATIONAL BACKGROUND', 'WORK', 'PRECINCT #', 'NOTE', 'REMARKS',
       'Unnamed: 22'],
      dtype='object')

In [9]:
df.describe()

       NO.  TOTAL FAMILY MEMBERS  WORK  Unnamed: 22
count  0.0             58.000000   0.0     5.000000
mean   NaN              2.568966   NaN    50.600000
std    NaN              1.201053   NaN    17.756689
min    NaN              1.000000   NaN    21.000000
25%    NaN              2.000000   NaN    48.000000
50%    NaN              2.000000   NaN    59.000000
75%    NaN              3.000000   NaN    59.000000
max    NaN              7.000000   NaN    66.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32089 entries, 0 to 32088
Data columns (total 23 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   NO.                     0 non-null      float64
 1   ORG                     32089 non-null  object
 2   LAST                    32089 non-null  object
 3   FIRST                   32089 non-null  object
 4   MIDDLE                  32041 non-null  object
 5   FULLNAME                32089 non-null  object
 6   YEAR                    32082 non-null  object
 7   MONTH                   32082 non-null  object
 8   DAY                     32083 non-null  object
 9   POSITION                32037 non-null  object
 10  ADDRESS                 32066 non-null  object
 11  BARANGAY                32089 non-null  object
 12  SEX                     32089 non-null  object
 13  CIVIL STATUS            80 non-null     object
 14  BIRTH PLACE             80 non-null     object
 15  PROVINCIAL ADDRESS      68 non-null     object
 16  TOTAL FAMILY MEMBERS    58 non-null     float64
 17  EDUCATIONAL BACKGROUND  66 non-null     object
 18  WORK                    0 non-null      float64
 19  PRECINCT #              32082 non-null  object
 20  NOTE                    10201 non-null  object
 21  REMARKS                 23 non-null     object
 22  Unnamed: 22             5 non-null      float64
dtypes: float64(4), object(19)
memory usage: 5.6+ MB

In [11]:
# indices = [0,13,14,15,16,17,18,20,21,22]
# list_of_columns_to_drop = []
# for ind in indices:
#     list_of_columns_to_drop.append(df.columns[ind])
# df.drop(labels=list_of_columns_to_drop, axis=1, inplace=True)

In [14]:
df['POSITION'].unique()

array(['MEMBER', nan, 'COORDINATOR', 'PUROK LEADER', 'PL'], dtype=object)

In [15]:
df['POSITION'].value_counts()

POSITION
MEMBER          32025
PL                  7
PUROK LEADER        3
COORDINATOR         2
Name: count, dtype: int64

In [16]:
df['POSITION'].fillna('MEMBER', inplace=True)

In [17]:
df.groupby('PRECINCT #')['ORG'].count()

PRECINCT #
0001A           27
0001B           21
0002A           17
0002A\t          1
0002B           15
                ..
685A             1
725A             2
9125C            1
F0337            1
NEW REGISTER     1
Name: ORG, Length: 1753, dtype: int64

In [18]:
df.groupby('BARANGAY')['ORG'].count()

BARANGAY
ACACIA            750
ACACIA              1
BARITAN           775
BAYAN BAYANAN       1
BAYAN-BAYANAN     913
CATMON           2557
CATMON            574
CONCEPCION       1531
CONCEPCION          1
DAMPALIT          940
FLORES            424
HULONG DUHAT     1142
IBABA            1128
LONGOS           3563
MAYSILO           977
MUZON             627
NIUGAN            374
PANGHULO         1627
POTRERO          3313
POTRERO            34
SAN AGUSTIN       813
SANTULAN         1555
TAÑONG           1647
TINAJEROS        1463
TONSUYA          3814
TONSUYA             1
TUGATOG          1544
Name: ORG, dtype: int64

In [20]:
df['NOTE'].unique()

array([nan, 'OK', 'NO ID', 'NO FORM', 'WITH ID', 'SANDOVAL', 'ETRYK',
       'CONCEPCION VOTER', 'NIUGAN VOTER', 'IBABA VOTER', 'BARITAN VOTER',
       'EDIT KKM', 'FOR OATH', 'TAÑONG VOTER', 'CHANGE ID',
       'NO ID & FORM', 'NO ID  ', 'ORETA', 'SANTULAN VOTER', 'NO ID '],
      dtype=object)